{
    "anarchism": "Anarchism",
    "anarchism_pa_empty_territories": "Power Void",
    "anarchism_pa_empty_territories_desc": "Unoccupied territories become anarchic, with a rate of <PER_TURN> per turn",
    "anarchism_pa_dice_tie": "Offensive Maniac",
    "anarchism_pa_dice_tie_desc": "Anarchism wins attacking ties and loses defense ties",
    "anarchism_db_attack": "Unbound Aggression",
    "anarchism_db_attack_desc": "If attacking an occupied territory is possible, Anarchism is obligated to do so",
    "anarchism_db_un_ban": "Enemy of Civilization",
    "anarchism_db_un_ban_desc": "Anarchism is banned from partaking in the UN council, even if it owns a council territory",
    "anarchism_bn_troop": "Spontaneous Spawn",
    "anarchism_bn_troop_desc": "Anarchism gains <TROOPS> troops after ending its turn (they are assigned to random owned territories)",
    "anarchism_bn_attack_stack": "Frenzy",
    "anarchism_bn_attack_stack_desc": "Winning an attack grants an attack bonus of +<BONUS> in the same turn, stacking up to <STACK> times (to a total of +<TOTAL>)",
    "anarchism_bn_pressure": "Fearsome Enemy",
    "anarchism_bn_pressure_desc": "After winning <ATTACKS> attacks in sequence and in the same turn, all attacked countries become pressured",
    "anarchism_su_black_block": "Black Block",
    "anarchism_su_black_block_desc": "Will attack all neighbor territories without stopping, prioritizing the one with the least enemy troops. The Black Block regenerates <HP> HP if the attack succeeds",
    "anarchism_su_black_block_spawn_condition": "Anarchism loses <TERRITORIES> territories in sequence",
    "anarchism_su_black_block_spawn_location": "Last occupied territory",

    "feudalism": "Feudalism",
    "feudalism_pa_defense": "Oath of Fealty",
    "feudalism_pa_defense_desc": "Troops can be sent to defend walls without movement restriction",
    "feudalism_db_one_attack": "Magna Carta",
    "feudalism_db_one_attack_desc": "Feudalism can only attack once per turn",
    "feudalism_bn_troop_gain": "Vassalage",
    "feudalism_bn_troop_gain_desc": "Upon conquering a territory, Feudalism gains <TROOPS> troop(s), allocated to the newly conquered territory",
    "feudalism_su_dragon": "Dragon",
    "feudalism_su_dragon_desc": "Feudalism starts the game with one Dragon, starting with <HP> HP and gaining +<INCREMENT> HP each round until a max of <MAX_HP>. The dragon regenerates +<REG_HP> HP per turn if inside a walled territory",
    "feudalism_su_dragon_spawn": "Feudalism starts with the Dragon. If the dragon is killed, it'll respawn after <TURNS> turns",
    "feudalism_sa_wall": "Wall",
    "feudalism_sa_wall_desc": "Feudalism can create walls around <TERRITORIES> territory(ies). When another party attacks this territory, they'll have to roll a d6 for each troop, only troops that succeed in this d6 roll against the wall can continue the attack",

    "socialism": "Socialism",
    "socialism_pa_movement": "???",
    "socialism_pa_movement_desc": "While moving through allied territory and with at least <TROOPS> troops, the Red Army has no movement restriction",
    "socialism_db_famine": "Famine",
    "socialism_db_famine_desc": "The scarcity of nourishment is evident, extreme hunger kills <UNIT> in every <BATCH1> troops. Active only if the number of troops exceeds <BATCH2>",
    "socialism_bn_dice": "???",
    "socialism_bn_dice_desc": "Gets a bonus of +<BONUS> on rolls with a numerical disadvantage (be it attack or defense)",
    "socialism_su_spawn_condition": "Moscow Revolution",
    "socialism_su_spawn_condition_desc": "In order to spawn most Special Units, Socialism needs to lose the Moscow territory and conquer it back",
    "socialism_su_lula": "Lula",
    "socialism_su_lula_desc": "Single-handedly rescued trillions from poverty, the <FAMINE> debuff is suspended while Lula is alive",
    "socialism_su_lenin": "Vladimir Lenin",
    "socialism_su_lenin_desc": "Allows Socialism to use Anarchism's passive for 1 turn, rendering a random non-occupied territory socialist",
    "socialism_su_stalin": "Joseph Stalin",
    "socialism_su_stalin_desc": "Transforms Vladivostok into a <GULAG1> haven, the <GULAG2> can only be destroyed once Joseph Stalin is killed",
    "socialism_su_stalin_spawn_condition_1": "Control over Vladivostok",
    "socialism_su_stalin_spawn_condition_2": "<LENIN>'s death",
    "socialism_su_morus": "Thomas Morus",
    "socialism_su_morus_desc": "Morus longs for an utopia, if Morus is kept for <TURNS> turns in Cuba, he'll sacrifice himself to transform Cuba into the <UTOPIA_ISLAND>",
    "socialism_su_wilson": "Wilson",
    "socialism_su_wilson_desc": "A dormant operative, every turn Wilson rolls a d6. If Wilson gets a (non-wrapping) numerical sequence of length <LENGTH>, he'll evolve into <THE_RED_GOD>",
    "socialism_su_wilson_spawn_condition": "Every other Socialist Special Unit (except for <THE_RED_GOD> and <WILSON> himself) needs to have been at the board at some point in the current game",
    "socialism_su_red_god": "The Red God",
    "socialism_su_red_god_desc": "You can run, but you can't hide. The Red God can fly and has a bonus of +<BONUS> on every roll",
    "socialism_su_red_god_spawn_location": "Where Wilson was before evolving",
    "socialism_su_red_god_spawn_condition": "Wilson needs to roll a (non-wrapping) numerical sequence of length <LENGTH>",
    "socialism_sa_gulag": "Gulag",
    "socialism_sa_gulag_desc": "While instated, Every troop killed by Socialism ends up in the Gulag, becoming a part of the Socialist army with a rate of <RATE> per turn",
    "socialism_sa_utopia_island": "Utopia Island",
    "socialism_sa_utopia_island_desc": "While instated, suspends the <FAMINE> debuff and grants Socialism <TROOPS> per turn",
    "socialism_sa_tsar_bomb": "Tsar Bomb",
    "socialism_sa_tsar_bomb_desc": "Capable of destroying a whole continent. The Tsar Bomb takes <CAST> turns to cast and the <FAMINE> debuff is multiplied by <MULTIPLIER> while it's being cast. After ravaging the land, the Tsar Bomb leaves a radiation falloff for <RAD> turns, rendering the land hostile to human life for its duration, killing every troop that enters it",


    "capitalism": "Capitalism",

    "": ""
}